# вывод
# print("hello world")



# создание и вывод переменной
# num = 2
# print(num)



# типы данных
# num_int = 8
# num_float = 8.4
# num_bool = True
# num_str = "77 777"



# пример названия переменных
# print = 5
# print(print)
# num1 = 0
# print(num1)
# hello_world = 0
# print(hello_world)
# helloWorld = 0
# print(helloWorld)



# арифметические операторы
print(4 + 4)
print(4 - 4)
print(4 * 4)
print(4 ** 4)
print(4 / 4)




# перезаписование переменной
# num_1 = 5
# print(num_1)
# num_1 = num_1 + num_1
# print(num_1)



# перевод типа переменной
# str_1 = "5"
# print(str_1 * 4)
# str_1 = int(str_1)
# print(str_1 * 4)



# вывод тип переменной
# print(type(5))
# print(type(5.1))
# print(type("5"))



# перевод типа переменной
# str_2 = "5"
# print(type(str_2))
# str_2 = float(str_2)
# print(type(str_2))
# print(str_2)



# перевод типа переменной
# print(float(4))
# print(int(4.9))



# вывод нескольких значений и переменных
# print("w",3,6,"-")



# ввод данных (строка)
# num_inp = input()
# print(num_inp)
# print(type(num_inp))



# ввод данных (число)
# num_inp = input("введите число --")
# num_inp = int(num_inp)
# print(type(num_inp))
# print(num_inp * 3)



# ввод данных (число)
# num_inp = int(input("введите число --"))
# print(type(num_inp))
# print(int(input("введите число --")) * 3)



# склеивание строк
# print("y" + "hi")
# num_3 = 8
# str_3 = "ответ: " + str(num_3)
# print(str_3)



# fстроки нужны для простой интеграции переменных внутрь строки
# str_5 = "llo"
# str_4 = f"ответ: {num_3}  he{str_5} {1}"
# print(str_4)



# символ
# print("1", " ", "p")



# вывод символа из строки
# str_6 = "привет"
# print(str_6[0])
# print(str_6[4])

# print(str_6[4] + str_6[1])





# dz
# задача 1
# Дана диагональ телевизора в дюймах. Написать программу, определяющую эту же диагональ в сантиметрах 
# (1 дюйм = 2.54 сантиметров).
# Ниже представлен пример для проверки программы 
# на корректностью

# задача 2
# Емкость аккумулятора смартфона составляет N мАч. 
# Написать программу, определяющую минимальную 
# емкость переносного зарядного устройства (powerbank), 
# если необходимо 3 полных заряда смартфона.
# Ниже представлен пример для проверки программы 
# на корректность.

# задача 3
# За один день хомячок съедает K грамм корма. Написать программу, определяющую закупку корма в килограммах на 30 дней.
# Ниже представлен пример для проверки программы 
# на корректностью

# задача 4 
# Пользователь вводит с клавиатуры денежную 
# сумму в рублях и копейках (рубли и копейки вводятся 
# в разные переменные). Сумма может быть введена как 
# правильно (например 19 руб. 90 коп), так и неправильно 
# (например 22 руб. 978 коп). Написать программу, которая, 
# используя только линейный алгоритм, осуществит корректировку введенной денежной суммы в правильную форму.
# Например, если пользователь ввел 11 руб. 150 коп, 
# программа должна вывести на экран сумму 12 руб. 50 копю

# задача 5
# Пользователь вводит с клавиатуры время 
# в секундах, прошедшее с начала дня. Вывести на экран 
# текущее время в часах, минутах и секундах. Посчитать, 
# сколько часов, минут и секунд осталось до полуночию

# задача 6
# Пользователь вводит с клавиатуры три числа. 
# Посчитать их сумму, произведение и среднее арифметическое.