# цикл while работает когда значение True
# while(True):
#     print("p6")


# num = 10
# while(num > 1):
#     num -= 1
#     print(num)
# print("end" , num)


# num_inp = input("==")
# while(num_inp != "exit"):
#     num_inp = input("==")
#     print("run")
# print("end" , num_inp)


# num_inp = input("==")
# while(num_inp != "exit"):
#     num_inp = input("==")
#     print("run")
# print("end" , num_inp)




# цикл for работает какое то количество раз

# for i in range(10):
#     print(i)
#     print("hi")


# for i in range(1 , 10+1):
#     print(i)
#     print("hi")


# range(x, y, z)
# x - start
# y - stop
# z - step
# for i in range(1 , 20+1 , 3):
#     print(i)
#     print("hi")


# for i in "qwerty":
#     print(i)


# num_2 = "qwerty"
# for i in range(len(num_2)):
#     print(i)
#     print(num_2[i])


# for x in range(10):
#     for y in range(10):
#         print("x =" , x , "y =" , y)


# for y in range(10):
#     str_num_x_y = ""
#     for x in range(10):
#         str_num_x_y += f"{x}{y} "
#     print(str_num_x_y)
    



# дз

# https://metanit.com/python/practice/3.php

# Задание 1. Написать имитацию кассового аппарата для 
# магазина, торгующего новогодними товарами. Кассир 
# должен выбрать товар из списка, ввести его количество, 
# затем выбрать следующий товар. По завершению ввода 
# вывести на экран всю сумму покупки. Предусмотреть 
# наличие скидки. В списке товаров должно быть не меньше 
# 4-х товаров, должна отображаться их цена. Предусмотреть 
# неправильно вводимые данные.
# . Хранение общей выручки магазина;
# . Ограничить количество товара в магазине

# Задание 2. Написать программу-конвертер валют.
# Реализовать общение с пользователем через меню.

# Задание 3. Написать программу, которая проверяет пользователя на знание таблицы умножения. Программа выводит на экран два числа, пользователь должен ввести их 
# произведение. Разработать несколько уровней сложности 
# (отличаются сложностью и количеством вопросов). Вывести пользователю оценку его знаний.

# Задание 4. Вывести на экран ромб из звездочек.

