# обычное деление 
print("10 / 3 =" , 10 / 3)
# деление без остатка
print("10 // 3 =" , 10 // 3)
# остаток от деление
print("10 % 3 =" , 10 % 3)



# условие
num = 2
if(num != 2):
    print(num)



# Логические операторы:
print("2 == 2  =" , 2 == 2)
print("2 != 2  =" , 2 != 2)
print("2 < 3  =" , 2 < 3)
print("2 > 3  =" , 2 > 3)
print("2 <= 3  =" , 2 < 3)
print("2 >= 3  =" , 2 > 3)



num_1 = 5
num_2 = 8
# if(num_1 < 10 and num_2 > 2):
#     print("ok")



# иначе
num_3 = True
if(num_2 == 4 and num_3):
    print("ok")
else:
    print("not ok")



# цепочка условий 
num_4 = 5
if(num_4 == 9):
    print("if_1  num_4 == 5")
elif(num_4 != 3):
    print("if_2  num_4 != 3")
elif(num_4 <= 12):
    print("if_3  num_4 <= 12")




# dz:
# Задание 1. Пользователь вводит число. Определить, является ли оно четным.

# Задание 2. Пользователь вводит два числа. Вывести на 
# экран меньшее из этих чисел. 

# Задание 3. Пользователь вводит число. Определить, положительное это число, отрицательное или равно нулю.

# Задание 4. Пользователь вводит два числа. Определить, 
# равны ли эти числа, и если нет, вывести их на экран в порядке возрастания

# Задание 5. Пользователь с клавиатуры вводит 5 оценок 
# студента. Определить, допущен ли студент к экзамену. 
# Студент получает допуск, если его средний балл 3 балла 
# и выше.

# Задание 6. Пользователь вводит с клавиатуры число. Если 
# оно четное, умножить его на три, иначе — поделить на 
# два. Результат вывести на экран.

# Задание 7. Написать программу-калькулятор. Пользователь 
# вводит два числа и выбирает арифметическое действие. 
# Вывести на экран результат

# доп
# https://okpython.net/python/python_zadachnik/python_zadachnik.html#ex_9
