
# file_1 = open("file_las_1.txt")
# print(file_1)



# режимы открытия:
# 'r'	открытие на чтение (является значением по умолчанию).
# 'w'	открытие на запись, содержимое файла удаляется, если файла не существует, создается новый.
# 'x'	открытие на запись, если файла не существует, иначе исключение.
# 'a'	открытие на дозапись, информация добавляется в конец файла.
# 'b'	открытие в двоичном режиме.
# 't'	открытие в текстовом режиме (является значением по умолчанию).
# '+'	открытие на чтение и запись



# file_2 = open("file_las_1.txt" , "r")
# print(file_2.read())
# print(file_2)



file_3 = open("file_las_1.txt" , "w")
file_3.write("2e2eee")







